{
  "details": [
    "<p><strong>Using the Integration Designer</strong></br>Information exchange basically helps in having an eagle eye view on the data types the system is having.</br> Clicking on Data in App Studio shows us a Data model view where system of record is mentioned in header and each data type is shown as a row.</br> The system of Record also shaows a number. This number signifies how many data source are referred by this system.</br> In a row, along with Data type, it shows to how many views are referred by this dsts type.</br> Data view access data from range of sources.</br> Each Data view represents an instance of how your application is using the data.</br> Clicking on a Data type open the Data model view. You may click on Related Data type to see a graphical representation of how the selected data type relates to other data types.</br> In the graphical presentation, you can see the data types and systems of ecord a case type is connected to by clicking the case type.</br> You can click on Legend to view a legend explaining the systems used in this graphic.</br> Once you compress thje Related Data Types, click on the Data Views tab to see the Data views associated with the selected data type.</br> It shows a tabular format with following three columns</br> Data view</br> Type</br> Source</br> </br> Data view shows the fields associated with the Data view</br> Type shows the field Type of the fields associated with Data view</br> Source shows the Data source in use. It may be Simulated or Data base or Rest.</br> </br> In the Data model view, there is a reference By column. The reference by column shows the case types and Data types which are referring the Data type.</br> The system of record column shows the system or systems of record the data type uses.</br> </br> System of record for the data type can be updated by clicking on Fix Now.</br> Action items (three dots in a vertical line) can be used to delete a data source.</br> </br> The integration landscape is a visual map of the data types in the application and where they are sourced.</br> You may click on View Integration Landscape to display the landscape.</br> </br> Integration landscape shows a view where the application data types display down the center of the visual map. The data types with red backgrounds are linked to simulated systems of record.</br> Line connects data types to their source system of record. The thicker lines indicate more data views.</br>  "
  ]
}
