
{
  "details": [
    "<p><strong>What is the new feature with Email Triaging?</strong> The system uses duplicate case logic to match existing cases with new ones. In addition, the system shows you a list of potential duplicates before it creates business cases",
    "<p><strong>What is override case detail section?</strong> From the Override case details section, you can see the most relevant case information which may be overridden by new incoming mail.",
    "<p><strong>How to speed up the Email training?</strong> By Mapping data to business case. Right clicking on the email body content or text analytics will help you sort out this.",
    "<p><strong>What system does to enhance the text analytics results during email triaging?</strong> The system can pull data such as date, name, address and spun off appropriate business case.It can highlight the text in analysis page too.",
    "<p><strong>What is intelligent email routing criteria?</strong> Pega Intelligent Virtual Assistant (IVA) for Email is smart enough to set up a routing based on detected language, a when rule, and keyword-based entities.",
    "<p><strong>How Pega Intelligent Virtual Assistant (IVA) for Email can be used to create case faster?</strong> Email content data can be extracted faster using system and using entity mapping or email-specific properties, such as an email address or a subject, we can create a business case faster.",
    "<p><strong>What is role-based workspace?</strong> Starting with Pega 8.1, there are workspace or studio which provides specific features or tools based on the role of the user.",
    "<p><strong>What are role-based workspaces available?</strong> App Studio, Dev Studio, Admin Studio, Prediction Studio",
    "<p><strong>What is App Studio?</strong> This workspace provides core features for application developement such as case design, data management and user experience.It was formerly known as Pega Express.",
    "<p><strong>Which users are supposed to use App Studio?</strong> Application Developer, Front end developer, Data engineer, Business Analyst",
    "<p><strong>What channels of interface can be created in App Studio?</strong> Web, Mashup, Mobile, Email, webchat, facebook",
    "<p><strong>What is dev studio?</strong> It was formerly known as Designer Studio. This workspace provides advanced features for application developement.",
    "<p><strong>Which users use Dev studio?</strong> Full-stack developer, database administrators and security administrators.",
    "<p><strong>What's difference between Dev studio and App studio?</strong> Using Dev studio, customization can be done for rules and build reusable components. These components can be configured in App Studio too.",
    "<p><strong>What is Admin Studio?</strong> This workspace provides run-time information and configuration options to enable you to monitor your production systems.Most of the SMA features are available here.",
    "<p><strong>What is Prediction Studio?</strong> This workspace provides features for data scientists to build machine-learning models for adaptive, predictive and text analytics.",
    "<p><strong>What are features of an application overview page?</strong> This page shows the aggregate data on supported channel interfaces, case types, data types.\nThis page helps in finding and monitoring the key components of your application.\nThis page helps in making informed decisions about how someone wants to allocate the developement resources.\n\tFor example, you can compare the life-cycle stages in your case types to identify inconsistencies and opportunities for reuse, or review your channel interfaces to find new ways to engage customers.",
    "<p><strong>What is Managing relevant records?</strong> This is a process by which developer marks the relevant records for a class.",
    "<p><strong>How to Access the Managing records management tab?</strong> You can right click on a class in App explorer to access this.",
    "<p><strong>How to mark a rule relevant?</strong> You can mark a specific record as relevant for it`s class directly on the record`s rule form.",
    "<p><strong>Whats new about Archiving inactive cases in Pega 8?</strong> This feature can be configured from case type rule to archive your cases based on number of days. \nRegarding where to store it, that need to be configured if you are not using pega cloud.",
    "<p><strong>What`s true about documents?</strong> Documents are files that contain additional information about cases and are shared with all users in your application. \nThe Documents landing page consolidates all the important content for your application in one place. \nDocuments enable you to resolve cases more quickly by making it easier to collaborate on shared case content with other users in Pulse.\nYou can open the document listed in the Recent documents section of the case and use Pulse to consult other approvers.",
    "<p><strong>What is Parent-child resolution?</strong> This configuration resolves child cases when a parent case reaches the end of its life cycle. You can optionally assign a final status to child cases that is different from the final status of the parent case.",
    "<p><strong>What is Stage-level case status?</strong> This configuration changes the status of a case when the case moves from one stage to another in the case life cycle. You can choose an existing status or create a custom status.",
    "<p><strong>What is Conditional stage entry?</strong> This configuration skips a stage in the case life cycle, based on the conditions that you define. You can compare the values of fields in a case to create simple or complex conditions.",
    "<p><strong>What`s new in survey?</strong> With multi-answer survey questions you can collect a series of related responses. Use this type of question to design concise surveys.",
    "<p><strong>What is spacex?</strong> Spaces are areas in the application that enable groups of users to collaborate on a specific area of interest by using Pulse. By restricting the discussion of certain topics to the users of a space, you can avoid broadcasting irrelevant messages to all users in your application.",
    "<p><strong>Who are Case participants?</strong> Case participants are people, businesses, and organizations that are involved in a case.",
    "<p><strong>What is Private message?</strong> Private messages in Pulse are posted only for selected users within a context, such as a case or an application. ",
    "<p><strong>Can we create and enable custom message types in Pulse?</strong> Yes",
    "<p><strong>Can we configure SLA from case stages?</strong> Yes, we can configure even the correspondence or message we want to sent to the participant",
    "<p><strong>What is conversational channel?</strong> Pega Intelligent Virtual Assistant™ (IVA) is a conversational user channel through which users interact with a Pega Platform™ application in multiple ways.",
    "<p><strong>What are entities?</strong> Entities are a specific type of data that is detected using natural language processing (NLP).",
    "<p><strong>Can we create custom entites?</strong> You can now easily create custom entities that precisely match your use case and train the model with a single click. ",
    "<p><strong>What can I do from IVA for email?</strong> From the training data screen of Intelligent Virtual Assistant for Email, \nyou can create entities and immediately correct any misidentified entities. \nYou can then re-build the model and see those changes reflected immediately.",
    "<p><strong>What is Email Manager portal?</strong> The new portal helps you to efficiently and seamlessly triage emails by combining email, case management, and artificial intelligence."
  ]
}
