{
  "details": [
    "<p><strong>According to best practice,how should we start implementation of business logic?</strong></br></br>Create a simple set of logic with very few rules first. Once the initial version is tested and proven to the business teams, more complex and sophisticated rules can be added.",
    "<p><strong>According to Forbes it costs ___ times as much to acquire new customers as it does to keep old ones.</strong></br></br>5",
    "<p><strong>An adaptive model is displayed on the Adaptive Model Management landing page when __________.</strong></br></br>A strategy that contains an Adaptive Model component is executed.",
    "<p><strong>BAU means?</strong></br></br>Business as usual...",
    "<p><strong>The Behavior report enables you to __________.</strong></br></br>Identify active and inactive predictors.",
    "<p><strong>Decision components are grouped into categories.Which category contains the prioritization component?</br>- Selection</br>- Priority</br>- Business Rules</br>- Arbitration</strong></br></br>Arbitration",
    "<p><strong>The first step in the Model analysis step is ____________?</strong></br></br>Score comparison",
    "<p><strong>The hard rules usually determines .........</strong></br></br>... that the customer is or is not eligible for a particular product",
    "<p><strong>How can Administrators and Supervisors use to inspect performance of the decisioning system in detail?</strong></br></br>Monitor Adaptive Models Monitor Interaction History Browse Reports",
    "<p><strong>How can a Strategy Designer get access to additional rules to change which are not in the current change request ?</strong></br></br>Send back the change request",
    "<p><strong>How can you access the customer property Age in a filter expression?</strong></br></br>Primary.Age",
    "<p><strong>How many access groups can be created using the application overlays wizard? (Choose One)</strong></br></br>5",
    "<p><strong>How much more does it cost to find a new customer than to keep an old one?</strong></br></br>5 times as much",
    "<p><strong>If a retention strategy is defined under 'Sales' issue then it can access properties: (Choose Two)</strong></br></br>As defined at the 'Sales' issue level As defined at the 'All Strategies' level",
    "<p><strong>Improving ____________ is the essence of Next-Best-Action.</strong></br></br>Customer Experience",
    "<p><strong>In a business sandbox, what can you use the Decision Manager Portal for?</strong></br></br>Manage revisions of the decision artifacts Change business rules and propositions Run tests and simulations to verify changes",
    "<p><strong>In a simulation configuration, the data flow rule is used to define the: (Choose One)</br>- A Visual Business Director output.</br>- Propositions to be offered.</br>- KPI to be used.</br>- Strategy to be used</strong></br></br>Strategy to be used",
    "<p><strong>In Decision Management the definition of a proposition is ____________</strong></br></br>The proposed course of action",
    "<p><strong>In order to set-up a '1-to-many' data relationship for the customer class, which of the following steps should you take? </br>1) Create a property of type Page on the customer class.</br>2) Define the class relationships in the Decisioning ->Infrastructure landing page. </br>3) Define primary key-foreign key relationships in the database to join the tables.</br>4) Create a property of type Page List on the customer class.</strong></br></br>Create a property of type Page List on the customer class",
    "<p><strong>In order to use a new strategy in the TopOffers process you update the _______________.</strong></br></br>interaction rule to point to the new strategy",
    "<p><strong>In our predictive model we reduce the number of histogram bins from 10 to 2 because</strong></br></br>the customer behavior is very similar in each group",
    "<p><strong>In Pega Decisioning how can you compare the performance of two different models? (Choose One)</strong></br></br>Creating a feedback loop.",
    "<p><strong>In Pega Decisioning to randomly select between two predictive models you use ____________.</strong></br></br>The Champion Challenger component.",
    "<p><strong>In production, what can you use the Decision Manager Portal for?</strong></br></br>Monitor effectiveness of decisions Inspect interaction history Manage and inspect the details of the adaptive models",
    "<p><strong>In revision management, what are the responsibilities of the Revision Manager?</strong></br></br>Setting up new revisions Creating change requests Assign change requests to Strategy Designers Approve/Decline change requests after analysis Create revision package to hand over to an SA",
    "<p><strong>In revision management, what are the responsibilities of the Strategy Designer?</strong></br></br>Working on change requests by modifying one or more business rules Testing and validating changes Submit changes for approval Request access to additional rules",
    "<p><strong>In revision management, whatare the responsibilities of the System Architect?</strong></br></br>Giving Revision Managers and Strategy Designers access to business rules To bring revised versions of the business rules into production via revision packages",
    "<p><strong>The Interaction Historycomponent can be used to retrieve history ________.</strong></br></br>for a specific customer",
    "<p><strong>In the Decisioning Analytics category we can find the Adaptive Model, Predictive Model, and _______ components</strong></br></br>Scorecard Model",
    "<p><strong>In the next best action, what is the optimal action?</strong></br></br>The optimal action is the one that satisfies customer expectations while also meeting business objectives.",
    "<p><strong>In the strategy Sales Account strategy you have used the CLV_Threshold property to ______ ?</strong></br></br>Establish if a customer is eligible for a proposition.",
    "<p><strong>In Visual Business Director, when comparing the results of simulations source versus a reference data source, the red colur indicates:</strong></br></br>The KPI value in the reference simulation is higher than the value in the source simulation.",
    "<p><strong>In which Communication Channels would Next-Best-Action Advisor apply?</strong></br></br>Inbound / real-time intelligent interactions",
    "<p><strong>Next-Best-Action ensures thatthe communications between business and the customer are: (Choose Two)</strong></br></br>Contextual Timely",
    "<p><strong>The Next-Best-Action strategy ____________.Choose One :can present all available offers can only present top 3 offers always presents all available offers can only present the top offer</strong></br></br>can present all available offers",
    "<p><strong>In the Decision Manager portal the first step required in a change management process is ____________</strong></br></br>To create a revision",
    "<p><strong>A PMML compliant predictive model can be configured in a DSM strategy using</strong></br></br>The Predictive Model component.",
    "<p><strong>Predictive Model Markup Language was designed to _______</strong></br></br>Describe predictive models and data transformations.",
    "<p><strong>The predictor overview report enables you to __________.</strong></br></br>Inspect the use of predictors across all adaptive models.",
    "<p><strong>The 'Properties mapping' tab in a Data Join component is used to ... (Choose Two)</strong></br></br>Set value of a property for successfully joined records. Copy property values from the joined component to source component.",
    "<p><strong>Propositions are frequently divided intro four business issues, which?</strong></br></br>Cross-Sell Upsell Retention Service",
    "<p><strong>A revision activated by the System Architect to all operatorsa can be ____________(Choose one)</br>- Deactivated</br>- Deleted</br>- Rolledback</br>- Reverted</strong></br></br>Rolled back",
    "<p><strong>ROI means?</strong></br></br>Return of investment...",
    "<p><strong>The Set Property decision component can be found in the ________ category.</strong></br></br>Enrichment",
    "<p><strong>Simulation results can be written to: (Choose Two) </br>- Database via Class </br>- Customer class </br>- Visual Business Director </br>- Database via SQL </br>- Proposition table</strong></br></br>- Database via Class </br>- Visual Business Director",
    "<p><strong>Three things need to be done to configure an adaptive model record. Which? (Choose Three)</br>1) Indicate which customer response values will be used to indicate positive behavior. </br>2)Indicate which customer properties will be used as predictors.</br>3) Indicate which customer response values will be used to indicate negative behavior.</br>4) Indicate the output properties.</strong></br></br>1,2,3"
  ]
}
