
{
  "details": [
    "<p><strong>To which types of decision can Pega DecisionManagement be applied? (Choose Three)</strong>\nDetermining which channel to use to communicate with a customer. \nDetermining whether or not to up-sell a product to a customer in a busy call center. \nDetermining which product to offer to a particular customer.",
    "<p><strong>(True / False) Only employees with PhD's or similar qualifications can build models in Predictive Analytics Director</strong>false",
    "<p><strong>(True / False) Predictive models can only be used to identify potential churn</strong>false",
    "<p><strong>(True / False) The more predictor groups you have the more accurate and reliable the prediction will be.</strong>false",
	"<p><strong>A typical example of behavior when a scoring model can be used is ____________ (Choose One) \n- Repaying loans or going into arrears Likely purchase value of responders to a direct mail campaign \n- The likely eventual writeoff of cases recently falling into arrears \n- The likely claim value of health, motor or contents insurance policy holders</strong>Repaying loans or going into arrears",
    "<p><strong>Using Predictive Analytics Director you can build a model of type ____________ (Two)</strong>\nSpectrum \nScoring",
    "<p><strong>What are Contact rules?</strong>They utilize the Interaction History to prevent certain offers from being made multiple times to the same customer",
    "<p><strong>What are the four key characteristics of Next-Best- ction?</strong>\nContextual - Taking the very last input into account \nTimely - Next-Best-Action must be taken in an appropriate timeframe \nRelevant - Every action must be right for that particular customer based on everything known about the customer\nConsistent - Next-Best-Action must be consistent across every channel.",
	"<p><strong>What are the four standard reports available for Interaction History?</strong>\nAccept rate - Accept rate by proposition group\nVolume by channel -Information regarding which channel the propositions are accepted or rejected \nVolume by proposition - How frequently a proposition is being offered to the customer \nRecent interactions - A list of recent interaction in a chronological order",
    "<p><strong>What are the property types available to a Strategy Designer for building decision strategies? (Choose Two)</strong>Proposition properties\nCustomer data",
    "<p><strong>What are the two approaches to predictive analytics?</strong>\nCreating a predictive model offline using historical data with a predictive modeling tool \nAdaptive analytics - Models created in real-time without human intervention",
    "<p><strong>What are Weights and Levers settings?</strong>Settings that you can use to change the balance of the prioritization to favor one objective over another.",
	"<p><strong>What can we do to access the interaction history of a proposition? (Choose Two) \n1) Use the Interaction History component. \n2) Use a Data import component to import interaction history. \n3) Nothing, the interaction history is always available. \n4) Enable interaction history in the Proposition Data component. \n5) Enable the interaction history strategy property.</strong>1,4",
    "<p><strong>What can we do with VisualBusiness Director? (Choose One) \n- A/B test two strategies \n- Write results of the simulation to a database table \n- Compare results with external data \n- Examine the customer distribution</strong>- A/B test two strategies",
    "<p><strong>What can you do in the Design Canvas?</strong>You can build and test strategies. You can also use Test Run which enables you to run simulations and test strategies for single or multiple customers.",
    "<p><strong>What decision strategy pattern would you use to filter out all propositions having their price higher than the average product price?</strong>Group by - Filter",
	"<p><strong>What does grouping of correlated predictors do?</strong>It uses only one of the predictors in the group to predict the outcome. \nBest practice is to select the best performing predictor in each group",
    "<p><strong>What does the decision component Aggregation do?</strong>It allows calculation of aggregate numbers. Things like monthly usage, average monthly account balances.",
    "<p><strong>What does the decision component Arbitration do?</strong>It filters out propositions that are less relevant for the customer.",
    "<p><strong>What does the decision component Business Rules do?</strong>\nIt applies business rules, such as eligibility requirements. \nDecision table, decision tree, map value, split",
	"<p><strong>What does the decision component Decision Analytics do?</strong>It makes predictions about the customer, often about their propensity. \nAdaptive Model, Predictive Model, Scorecard Model",
    "<p><strong>What does the decision component Enrichment do?</strong>It does calculations, such as margin calculation or cost of an offer.",
    "<p><strong>What does the decision component Import do?</strong>It brings additional data into the decision strategy. \nExternal data, Interaction History data, or proposition data.",
    "<p><strong>What does the decision component Selection do?</strong>It allows propositions to be ranked, so top offers for customers can be selected.",
	"<p><strong>What does the Monitor Adaptive Models page in the decision manager portal show?</strong>An overview of all adaptive models available in the adaptive decisioning data mart",
    "<p><strong>What does the MonitorInteraction History page in the decision manager portal show?</strong>All customer interactions in Visual Business Director.",
    "<p><strong>What does the Performanceoutput from adaptive models represent?</strong>How well the model is able to differentiate between positive and negative behavior.",
    "<p><strong>What do you create if you want to set up a '1-to-many' data relationship for a class?</strong>A Page List on the class",
	"<p><strong>What five steps does creating a predictive model include?</strong>\n1. Data preparation: identify the decision requiring a predictive model, select the input data, and define the behavior you want to predict \n2. Data analysis: prepare the data and develop relationships between potential predictor groupings and the outcome to be predicted \n3. Model development: analyze how the predictors work together and then create predictive models using Regression and Decision Trees \n4. Model analysis: compare predictors with each other to asses their performance. Typically looking at their behavior prediction capabilities and how they segment customers into classes according to predicted behavior \n5. Model export: you generate the model, including the definition of which field the model should output.",
    "<p><strong>What four key business directions are considered by Next-Best-Action?</strong>\nGrowth \nService \nRetention \nRisk Mitigation",
    "<p><strong>What gives Pega Decision Management its long-term memory?</strong>Interaction History",
    "<p><strong>What is a customer segment?</strong>A specific group of customers",
    "<p><strong>What is a good desciption of Nex-Best-Action?</strong>Next-Best-Action is a unique mechanism of balancing customer needs and business requirements.",
    "<p><strong>What is a Hard Business rule?</strong>Something that is either true or is not, no middle ground.",
    "<p><strong>What is a Proposition?</strong>Anything that can be offered to a customer.\nThe proposed course of action.",
	"<p><strong>What is a proposition under the covers?</strong>A data model that is organized into a three-level hierarchy.",
    "<p><strong>What is a Soft Business rule?</strong>\nSomething that has lots of variation and possible variables. \nSomething like ensuring that propositions have greater relevance to the customer, often used to up-weight or down-weight propositions under certain circumstances",
    "<p><strong>What is batch decisioning?</strong>Making decisions for groups of customers at once.",
    "<p><strong>what is Batch Decisioning?</strong>Decisioning that makes decisions for groups of customers at once.",
	"<p><strong>What is best practice when it comes to implementing Adaptive Models?</strong>Implement them from the outset of a project. \nThis enables the system to begin learning and adapting to customer behavior immediately.",
    "<p><strong>What is best practice when it comes to implementing Predictive Models?</strong>Make use of client's existing assets, if they have a model already use it and compare with Pegas models.",
    "<p><strong>What is Customer Retention?</strong>The activity of reducing customer defections or churn.",
    "<p><strong>What is descriptive analytics/business intelligence?</strong>Looking backwards at data that already exists and visualizes what happened.",
	"<p><strong>What is predictive analytics?</strong>Using past data to find patterns and use those patterns to predict what will likely happen in the future.",
    "<p><strong>What is Predictive Modelling?</strong>A data-mining technology that analyses historical data and generates a model to help predict the future.",
    "<p><strong>What is Proactive Retention?</strong>Removing obstacles and general annoyances which prevent the customer from being a service supporter and a loyal customer\nKeeping the customer happy and satisfied so they don't try to leave"    
  ]
}
