{
  "details": [
    "<p><strong>What is Propensity in Pega Decision Managementt?</strong></br></br>The likelihood that a customer will accept a particular offer, a number from 0 to 1.",
    "<p><strong>What is Reactive Retention? Why is it at problematic approach?</strong></br></br>It is offering incentives to stay when a customer tries to terminate existing contract. </br></br>This is bad because the customer is already dissatisfies and it requires direct contact with the customer.",
    "<p><strong>What is the Adaptive Decision Manager feature?</strong></br></br>It enables automatic development and deployment of adaptive predictive models.",
    "<p><strong>What is the Customer Intent consideration?</strong></br></br>It can register and use the customers current intent to upweight or down-weight certain offer",
	"<p><strong>What is the Decision Manager portal?</strong></br></br>An end-user facing portal, putting the business in charge of change, and IT in an auxiliary role.",
    "<p><strong>What is the Decision Strategies feature?</strong></br></br>It matches propositions with a customer. </br></br>It combines data about the customer with rules and predictive analytics to determine the Next-Best-Action.",
    "<p><strong>What is the definition of Optimal Action in Next-Best-Action.</strong></br></br>The action that satisfies customer expectations while also meeting business objectives.",
    "<p><strong>What is the Deltamode feature in Visual Business Director?</strong></br></br>It visually shows the difference in results between two different strategies",
	"<p><strong>What is the difference between model configuration and model creation?</strong></br></br>Business users define how adaptive models will be configured using an adaptive model record </br></br>The actual models are created automatically when a strategy using them is executed",
    "<p><strong>What is the goal of Next-Best-Action?</strong></br></br>To determine the optimal action to take with a customer at a given moment under the current circumstances. </br></br>To optimize customer value, to maximize the profitability of each customer relationship and to help retain profitable customers",
    "<p><strong>What is the goal of Revision Management?</strong></br></br>To empower the business users to make small changes and release them outside of the enterprise release cycle.",
    "<p><strong>What is the Interaction History feature?</strong></br></br>The long-term memory. </br></br>It captures every customer response and provides it as input for other parts of Pega.",
	"<p><strong>What is the Issue and Group hierarchy?</strong></br></br></br></br>It is used to build and house marketing artifacts. </br></br>Issues are the main issues the company wants to arbitrate across </br></br>Groups provide a logical way of organizing propositions",
    "<p><strong>What is the meaning of a dotted line between two decision components?</strong></br></br>A property defined in one is referenced by the other.",
    "<p><strong>What is the most efficient method to retrieve the last 60 days of interaction history?</strong></br></br>Update Interaction History component to fetch the last 60 days.",
    "<p><strong>What is the Predictive Analytics Director feature?</strong></br></br>Provides a heavily automated environment where business users can easily develop fit-for-purpose, nonadaptive predictive models.",
	"<p><strong>What is the Predictive Model Markup Language (PMML)?</strong></br></br>The de-facto standard to represent predictive and descriptive models, as well as data transformations. Pega can support any model made using this standard language.",
    "<p><strong>What is the propensity of an adaptive model before it has collected any data?</strong></br></br>0.5",
    "<p><strong>What is the Proposition Managements feature?</strong></br></br>It defines, stores, and manages propositions.",
    "<p><strong>What is the purpose of Model Analysis?</strong></br></br>To be able to create a shortlist of models and then select the best model for your use case.",
	"<p><strong>What is the purpose of the Interaction History component?</strong></br></br>To determine if a proposition has been offered before",
    "<p><strong>What is the Run Simulations page in the decision manager portal used for?</strong></br></br>To manage simulation runs for testing changes",
    "<p><strong>What is the Smooth Propensity concept?</strong></br></br>It keeps the propensity curve (and value) more smooth in the beginning of a models use, when you don't have a lot of data.",
    "<p><strong>What is the unique identifier for a proposition?</strong></br></br>The three levels in the proposition data model hierarchy.",
	"<p><strong>What is the Visual Business Director feature?</strong></br></br>A 3D graphical environment for simulating and analyzing results of decision strategies and customer interactions.",
    "<p><strong>What is the Visual Business Director (VBD)?</strong></br></br>Pega's 3D graphical environment for simulating and analyzing results of Decision Strategies in real time.",
    "<p><strong>What is three important concepts in Next best action, which comes from an old paradigm ... ?</strong></br></br></br></br>Listen </br></br>Learn </br></br>Act accordingly",
    "<p><strong>What privileges does the access group DecisionManager:Administrator have?</strong></br></br>This role is used in production where users need the ability to clean up adaptive monitoring data. This role comes with some responsibilities as they may significantly damage the production system.",
	"<p><strong>What privileges does the access group DecisionManager:DecisionArchitect have?</strong></br></br>This role is typically used in Business Sandbox environment, but it isapplicable in all environments and it should be restricted to Decisioning experts only. This role has full access to system capabilities.",
    "<p><strong>What privileges does the access group DecisionManager:RevisionManager have?</strong></br></br>This role is used in Business Sandbox environment. The role allows users to set up a new revision, create change requests, assign change requests to workbaskets and users, approve change requests and generate a revision package.",
    "<p><strong>What privileges does the access group DecisionManager:StrategyDesigner have?</strong></br></br>This role is used in Business Sandbox environment. The role allows working on change requests, change decision strategies, run simulations, test flows, submit changes for approval.",
    "<p><strong>What privileges does the access group DecisionManager:Supervisor have?</strong></br></br>This role is used in production environment where users need the ability to monitor the customer interactions and the performance of the adaptive models. With this role, users can not do any harm to the system, since they only have read-only capabilities.",
    "<p><strong>What role does Memory Size play in Trend detection?</strong></br></br>Typically, 3 adaptive models with different memory are used per proposition in trend detection. </br></br>The less memory, the faster the model will learn and change. This also means it is volatile. Faster models (less memory) are better short term while slow models (more memory) are better long term.",
    "<p><strong>What three elements comprise the decision logic in the system? And in what order should they be created?</strong></br></br></br></br>1. Business issues and proposition group hierarchy </br></br>2. Propositions </br></br>3. Prioritization",
    "<p><strong>What three levels exist in the proposition data model hierarchy?</strong></br></br>Business issue level - The ultimate purpose of the proposition (ex: saler, retention) </br></br>Group level - ex: phones, discounts, etc. </br></br>Name level - the actual name of the proposition",
	"<p><strong>What three levels of property scope exists?</strong></br></br></br></br>Scope global (top) - available to all propositions in the system </br></br>Scope issue - available to all propositions within the same issue </br></br>Scope group - available to all propositions within the same group",
    "<p><strong>What three personas are involved in the implementation of a Proactive Strategy?</strong></br></br></br></br>A Data Analyst, a data-savvy business person who creates the churn model. </br></br>A System Architect who configures the environment for the Strategy Designer to implement the churn model in the strategies used. </br></br>A Strategy Designer who modifies the existing strategies to implement the predictive model and test the application.",
    "<p><strong>What two terms is used to judge a decision model Performance?</strong></br></br>Accept Rate </br></br>Evidence",
    "<p><strong>What two types of models does the Predictive Analytics Director support?</strong></br></br></br>Scoring Models - for the prediction of binary behavior </br></br>Spectrum Models - for the prediction of continuous behavior",
	"<p><strong>What type of a predictor can you use in an adaptive model? </br></br>Integer Page Type Logical Symbolic</strong></br></br>Symbolic",
    "<p><strong>When are adaptive model instances created?</strong></br></br>When the strategy containing the Adaptive Model component is executed.",
    "<p><strong>When can two propositions have the same name?</strong></br></br>When they don't have the same business issue/group structure, so they don't have the same identifier",
    "<p><strong>When does a decisioning implementation process finish?</strong></br></br>Never",
	"<p><strong>When importing a PMML compliant model you must</strong></br></br>Map model predictors",
    "<p><strong>When invoking a decision strategy as part of the business process, where is the decision strategy defined?</strong></br></br>Interaction rule",
    "<p><strong>When is adaptive analytics most often used?</strong></br></br>To predict how new and unique propositions will perform."    
  ]
}
