{
  "details": [
    "<p><strong>When is a strategy executed?</strong></br></br>When you select Save & run during strategy testing.",
    "<p><strong>When training an adaptive model you must __________.</strong></br></br>Map the detected outcomes to the adaptive model outcomes.",
    "<p><strong>Where are the propositions defined?</strong></br></br>In a Decision Data rule",
    "<p><strong>Where can you show results of simulations?</strong></br></br>The standard Report Definition </br></br>Pega Visual Business Director - 3D environment",
	"<p><strong>Which are landing pages we associate with Pega Decision Management? (Choose Four) : </br>- Strategy </br>- Predictive Analytics </br>- Infrastructure </br>- Decisions </br>- Monitoring</strong></br></br>Predictive Analytics </br></br>Infrastructure </br></br>Decisions </br></br>Monitoring",
    "<p><strong>Which component can you use to randomly select between two decision components?</strong></br></br>Champion Challenger",
    "<p><strong>Which component makes the propositions accessible to a strategy?</strong></br></br>Proposition Data",
    "<p><strong>Which decision component do you use to import all records from an embedded 'Page List' into the strategy?</strong></br></br>Data Import",
	"<p><strong>Which decision rules can a Decision flows shape invoke? (Choose two)</strong></br></br>Decision Table </br></br>Scorecard",
    "<p><strong>Which is a decisioning specific flow shape? (Choose two)</strong></br></br>Run Interaction",
    "<p><strong>Which is a dimension in Visual Business Director? (Choose One) </br></br>Channel </br>Volume </br>Accept </br>Direction</strong></br></br>Channel",
    "<p><strong>Which is a standard interaction history report?</strong></br></br>Accept Rate by Proposition Group",
	"<p><strong>Which of the following is a key feature of Pega Decision Management? </br>- Case Management </br>- Interaction Service </br>- Adaptive Decision Manager </br>- Rule Decision Manager</strong></br></br>Adaptive Decision Manager",
    "<p><strong>Which of the following is a valid proposition? (Choose Three)</strong></br></br>A checking account upgrade offered to a savings account customer </br></br>A message on the call center agent's screen to redirect the customer call to the collections department </br></br>A home insurance bundle shown on the website to people looking for a mortgage",
    "<p><strong>Which of the following statement is true regarding the Filter and Prioritization component in a decision strategy? (Choose One) </br></br>The Filter condition is a numeric expression similar to the Prioritization expression. </br></br>The Filter component reduces the number of incoming data elements by allowing all rows for which the condition is false.</br></br>The Filter component reduces the number of incoming data elements by allowing all rows for which the condition is true. </br></br>A Prioritization component cannot reduce the number of incoming data elements since it is only ranking the incoming data</strong></br></br>The Filter component reduces the number of incoming data elements by allowing all rows for which the condition is true.",
    "<p><strong>Which of the following statements are true when using Test Run panel? </br>1) We must define a data transform before executing the strategy. </br>2) It enables to explore the property values of only the proposition components. </br>3) It enables to explore the property values of any of the decision components. </br>4) The property values are only updated when a strategy is checked-in.</strong></br></br>3",
	"<p><strong>Which of the following statements is true? (Choose One)</br></br>- System Architect can reexecute an application overlay wizard to create a new access group. </br></br>- Supervisor can monitor the effectiveness of adaptive models and reinitialize them. </br></br>- Supervisor can monitor customer interactions using Visual Business Director. </br></br>- System architect can create new privileges to customize the Decision Manager portal.</strong></br></br>Supervisor can monitor customer interactions using Visual Business Director",
    "<p><strong>Which of the following statements is true when describing PMML models (Choose One) : </br>1) PMML models are specialized models created by Predictive Analytic Director. </br>2) PMML compliant models cannot be used in the same strategies as Pega's own predictive models. </br>3) PMML compliant models can be used in the same strategies as Pega's own predictive models. </br>4) PMML model must be converted into PAD models before they can be used.</strong></br></br>PMML compliant models can be used in the same strategies as Pega's own predictive models.",
    "<p><strong>Which of these best describes Next-Best- Action?</strong></br></br>Balances customer need and business objectives.",
    "<p><strong>Which of these decision components are part of the Arbitration group? (Choose Two) :</br>- switch </br>- Filter by </br>- Filter </br>- Prioritization </br>- Contact Filter</strong></br></br>Filter </br>Prioritization",
	"<p><strong>Which of these should come first when implementing a decisioning project? </br>1) Define prioritization rules. </br>2) Any order is fine. </br>3) Issue and Group hierarchy. </br>4) Define which propositions we should use.</strong></br></br>Issue and Group hierarchy",
    "<p><strong>Which operators are created by the application overlay wizard?</strong></br></br>None",
    "<p><strong>Which statement describe Prioritization rules in the Next-Best-Action?</strong></br></br>Prioritization rules in strategies identify the top proposition for a customer at any given moment.",
    "<p><strong>Which statement is true when describing a simulation? (Choose One) </br>- Simulations are used to write to the Actuals data source. </br>- The only way to evaluate the results of the simulation is to examine Proposition Distribution report</br>- A simulation can be reexecuted. </br>- We must use the same data flow rule to compare simulations</strong></br></br>- A simulation can be reexecuted.",
	"<p><strong>Which strategy property holds the result of a customer interaction?</strong></br></br>pyOutcome",
    "<p><strong>Which strategy property is set by the adaptive model component in a strategy?</strong></br></br>pyPropensity",
    "<p><strong>Which two essential things does Next-Best-Action base each decision on?</strong></br></br>What does the customer need right now? </br></br>What are the business objectives for this interaction?",
    "<p><strong>Which values can be found on the Adaptive Model Management landing page? (Choose Two)</br>1) Number of Responses</br>2) List of Predictors</br>3) Performance</br>4) Number of Proposition Accepts</br>5)Model Propensity</strong></br></br>1) Number of Responses </br></br>3) Performance",
	"<p><strong>Who sets up the Decision Manager Portal?</strong></br></br>A system architect",
    "<p><strong>Why is collecting a high amount of data important for predictive analytics?</strong></br></br>Without enough data it is very hard to find good predictors",
    "<p><strong>Why is creating predictive models a balancing act between accuracy and reliability</strong></br></br>The more predictor groups you have, the more accurate the prediction will be. But having more groups also makes the model more sensitive to changes in actual behavior which makes the model less reliable.",
    "<p><strong>With prioritization, how are company objectives typically met?</strong></br></br>By weighting proposition in favor of: Product types Operational channels Business issues/groups",
    "<p><strong>With prioritization, how are customer objective typically met?</strong></br></br>By adjusting the propensity model, and as a result, the probability to accept an offer.",
    "<p><strong>You use baseline simulations to ____________.</strong></br></br>execute the existing strategies against a sample population"    
  ]
}
