{
  "details": [
    "<p><strong>  How to finetune the Performance of an Pega Application.</strong></br></br>\r\nPega is used vastly for heavy load applications involving millions number of users processing billions of cases.\r\nWe must have to make sure that the user experience remains healthy and up to the mark.\r\nWe can setup the thresholds of functionalities time like browser rendering time, db connection time, db query time etc...\r\n</br>\r\n</br>\r\nOnce the thresholds are set, if any operation takes more time than threshold time, alert is generated.\r\n</br>\r\n</br>\r\nPega has inhouse application like PDC or AES to monitor such alert and advise customer about their system.\r\nThe thresholds settings are configured in dynamic system settings which are instances of Data-Admin-System-Settings.\r\nThe thresholds can be set in prconfig.xml file too.\r\nIn general, if a prconfig setting is defined in a prconfig.xml file and is also defined through a Dynamic System Setting, the prconfig.xml takes precedence.\r\nMost of the thresholds are defined as dynamic system settings.\r\n</br>\r\n</br>\r\nThe pega application throws alerts based on the configuration.\r\nFrom the log files, alerts log can be accessed.\r\nThe alert may be due to the data base design or bad application design or due to bad quality code or due to improper configuration of memory.\r\n</br>\r\n</br>\r\nlet`s say an end User Screen in Pega Application is taking too much time to load which is more than the threshold time.\r\nDue to this an alert would be generated by system.\r\n</br>\r\n</br>\r\nWe need to analyze why it is more than threshold time.\r\nThis delay may be due to different reasons.\r\n</br>\r\n</br>\r\nFetching data from database and show that in Ui may be time taking.\r\nwe may need to cache this data to optimize the performance.</br>\r\nMay be we dont want to show that much data at one time.\r\nIf the data is not used frequently by users, may be we should have a different plan to fetch and show it.</br>\r\nMay be the way we are pulling data, it is pulling from blob. \r\nIn that case, we need to expose the properties (use dedicated columns for the properties).</br>\r\nMay be it is not blob but the Query involved to fetch data, using some where clause on a non-indexed table. \r\nIn such case, adding appropriate index to database table would be helpful.</br>\r\nMay be memory leak is happening as we are not cleaning up the memory after usage. We should Remove those memory.</br>\r\nAdding too much datapage takes lots of memory too. Use the datapage wisely.\r\n</br></br>\r\nThese are the few approaches we could use to fine tune the performance. Pega provides inhouse tool like PAL, performance profiler etc to help architect fine tune their applications.\r\n</br></br>\r\nHow to safeguard your future codings to be performance oriented.\r\n</br></br>\r\nIf you write any code which deals with data fetching from any database table, evaluate the query plan. \r\nWhile caching data, try to analyze the scope of data and time for which you want to keep it in memory.\r\nUse the best practices to develope the code. Some thing is done before in some way shouldn`t let you force to follow the same path. Be agile.\r\n</br></br>\r\nTools available in Pega to finetune the performance\r\n</br></br>\r\n<strong>PAL</strong>\r\nUse pal tool to analyze the statistics cover elapsed time, CPU time, bytes of data retrieved from the database, Blob operations and other data.\r\n<strong>Performance profiler</strong>\r\nThis need to be turned on unlike Performance Analyzer tool.\r\nThis tool produces a lot of detailed data and cost to the system. This tool traces execution of activities, when and data models.\r\n</br></br>\r\n<strong>Database Trace</strong>\r\nA tool that provides a comprehensive and detailed log of accesses to the PegaRULES database. The log shows the SQL statement and the elapsed time for each operation, and whether a rule was found in the rule cache.\r\n</br></br>\r\nPDC/AES are external pega application which can analyze the alert and give you the right output.\r\n</br></br>\r\nsome other approaches you may take to make your system more performant\r\nHave more than one node of the production server so that web nodes can be used for web users and util node can be used for background.\r\nTry to run the batch or nightly process when the server is not that loaded or not busy.\r\nPlease make sure the enduser shares the same rule assembly so system doesn`t need to do First-use assembly frequently. This would help system to deliver quality performance in less memory usage.\r\nSometimes, precompile your new rules so that enduser experience would be great.\r\nThis can be handled by running static assembler. This tool can assemble all rules of a specific ruleset, run by command line tool.\r\nYu may want to monitor the system health, performance etc using System Management Application. Post to 8, there is admin studio for the same.\r\n</br></br>\r\n<strong>some design to discuss</strong>\r\n</br>let`s say the UI is having multiple tabs to show different information. Configure\r\nthe tab to have deferred operation so that the functionality doesn`t need to fetch all data at one time.\r\nInstead of that fetch only the minimal data you want to display.\r\nThe data related to tab should be fetched upon tab click.\r\n</br></br>Recently, I was committing ten`s of thousand cases at same time. This was killing the node. This could be handled with minimum numbers like 100 cases at a time.\r\n</br>Don`t add too much layouts in your User Interface. This would add burden to the HTML Dom making it slow.\r\n</br>Some applications are CPU intensive and some are memory intensive. In CPU intensive application, try to take advantage of memory and vice versa. This would improve the overall performance.\r\n</br></br>\r\n<strong>Data page cache</strong>\r\n</br>let`s say you are using some data which is used very frequently by many threads of a requestor.\r\n</br>create a datapage and store this data for the use in threads. Well there is not exactly a distinction which says datapage cache might be very good or bad for your application.\r\n</br>We just need to tradeoff and find which approach would be better.\r\n\r\nP.S.: If you want any improvement upon this, please submit a feedback by sending a mail to ipega.learning@gmail.com\r\n\r\n\t"
  ]
}
