{
  "details": [
    "<p><strong>What is a Case?</strong>&nbsp;A case is a business transaction we want to complete; it is what we do.</p>\n<p><strong>What is a Process?</strong>&nbsp;Process is the path, or paths, the case follows as it is completed; process defines “how” we do what we do.</p>\n<p><strong><img alt=\"To see images, Turn on internet Connection\" src=\"https://drive.google.com/uc?id=1cZIrXFPEjCcz3LQvih3leXF2nENg0uSd\" style=\"width: 100%; height: 250px;\" /></strong></p> \n<p><strong>what is case management?</strong> management of the artifacts like people assigned to work the case; tasks to be performed; relevant documents and correspondences; a status; a history of actions taken; and a resolution</p> \n<p><strong>Which provides a more holistic view of a business transaction?</strong>&nbsp;Case Management</p>\n<p><strong>What can be included in a Case?</strong>&nbsp;Processes, other Cases, sub cases</p>\n<p><strong>What is Process management?</strong>&nbsp;It is a a way of ensuring a business transaction can be adapted to frequently changing business conditions</p>\n<p><strong>Technologists should define the business transaction the way business people discuss – and understand – that transaction, for a better vision</strong>&nbsp;true</p>\n<p><strong>It`s critical that Business people should be engaged with technologist for the expected project deliveries?</strong>&nbsp;true</p>\n<p><strong>What is the advantage when When business people and technologists share an understanding of the business transaction?</strong>&nbsp;Errors due to misinterpreted requirements are greatly reduced</p>\n<p><strong>What is Build for Change?</strong>&nbsp;build your solutions in such a way that future changes can easily be accommodated. This effort includes identifying, and delegating responsibility for updating to Business Managers.</p>\n<p><strong>How case is resolved with business transaction?</strong>&nbsp;A case is a business transaction to resolve.</p>\n<p><strong>Case is seen as work moving through a series of stages.</strong>&nbsp;true</p>\n<p><strong>What is the primary difference between a case and a process?</strong>&nbsp;A case represents a business transaction and a process defines the tasks that must be accomplished to resolve that business transaction.</p>\n<p><strong>What are some of the advantages of an all-in-the-model design approach?</strong>&nbsp;1.Using an “all-in-the-model” approach provides greater visibility into what is already defined in the application, which allows for greater reusability.2.If we define the business transaction the way business people discuss – and understand – that business transaction, it makes it much easier to capture their vision.3.When business people and technologists share an understanding of the business transaction, errors due to misinterpreted requirements are greatly reduced.</p>\n<p><strong>Business processes define</strong>&nbsp;A process defines the sequence of processing an application applies to work items.</p>\n<p><strong>Engaging the business and keeping them engaged throughout the build effort should be a first priority.</strong>&nbsp;true</p>\n<p><strong>What is the difference between case management and process management?</strong>&nbsp;Case management provides for a more holistic view of a business transaction. Process management provides a way of ensuring a business transaction can be adapted to frequently changing business conditions.</p>"
  ]
}
