{
  "details": [
    "<p>When you are interacting with customer, you want your customer to buy your product, use your services and have a great experience.</br> To lead the market and be ahead from your competitors by ensuring that each conversation delivers exactly the right message, offer and level of service. </br>  </br> Ptga`s omni-channel AI delivers the right action by processing millions of data. </br> Making an offer, initiate a retention plan, predict a problem, predict a solution for a problem in appropriate time. </br> Every decision generates the next best action for your business and customer. </br>  </br> Pega`s AI is built for business people with visual tools to strategise the algorithms to mine large sets of data. </br> With Pega`s nxt best action, you would have options to take any/all potentials actions take with a customer. </br> The potentials actions might be to make an offer, initiate a retention plan, open a service case, place an ad. </br> The potential action can be taken across any/all channel. </br> Pega strategies are contexual as they take the customer click, reply,location chnage, tweet etc in to account before suggesting next best action. </br> Pega’s Realtime, Omni-channel AI puts the power in your hands – so you can optimize every customer interaction for experience, and value. </br>  </br> 	Prediction Stidio mostly focus on defining AI models and assets. </br> Predictive analytics </br> Adaptive analyticsText analytics </br> Transparency policies </br> Data exploration </br>  </br> This is targetted for data scientist and decision architects. </br>  </br> Predictive Studio provides three distinct areas </br> Predictions </br> Aligns to the current analytics center. </br> Provides access to Predictive, Adaptive and Text analytics models. </br> Data </br> Data sets </br> Interaction History Summaries </br> Settings </br> Globally configure model settings </br> Set model transparency policies to support transparent AI </br>  </br> There are two approaches to predicting behavior: “predictive analytics” – which uses historical data to discern patterns of behavior, or, “adaptive analytics” – which learns from every customer interaction. Both approaches can be used to make predictions about future behavior. </br>  </br> <strong>Predictive Analytics</strong> </br> Pretty much every organization retains data about their customers. What products they buy; how they manage their credit accounts; what their preferences are, etc. This historical data provides useful information about past customer behavior. By analyzing this data, you start to discover patterns – and these patterns can be captured as a 'predictive model.” </br>  </br> Predictive models use historical data to predict future customer behavior. This makes it possible to personalize each customer interaction according to the individual customer. Predictive models combined with business rules become the foundation of every decision. </br>  </br> It starts with a data set, which is called a customer analytical record. This is a single record that contains all of the information you have about a customer. Each customer is labeled with a Case number, and the customer data is associated with that Case number. The data is the usual stuff: name, address, age, gender, etc. To this we add the customer’s past behavior, in other words, their 'accepts' and 'rejects' of the various propositions that have been offered to them. We use this behavior data plus the profile data to create a predictive model. But before the model can be created, we need data from similar customers. The idea is that two customers with similar attributes, under the same set of circumstances will make similar choices and therefore behave in the same way. </br>  </br> <strong>Adaptive Analytics</strong> </br> Predictive models are built on historical data, and therefore, they cannot take into account rapidly changing business conditions. For example, as you take on new customers, their interests and behaviors might be different from the interests and behaviors of the customers used to create your predictive models. </br>  </br> Updating predictive models takes time, during which new information is not being added to the models. Your ability to 'adapt' to changing business conditions is slowed down – and that has an impact on competitive advantage. </br>  </br> Adaptive models are designed to learn in real time. With each interaction, new customer behaviors are added to what you already know about existing behavior patterns. </br>  </br> Instead of relying only on static models that might be out-of-sync with current trends, adaptive models automatically detect change and act on it in real time during customer interactions. </br>  </br> Adaptive models can help establish customer preferences without the need for historical data and can automatically adapt predictive models during customer interactions. </br>  </br> Once the proposition is offered, and the customer’s response is captured, this new evidence is given to Adaptive Decision Manager, which uses it to refine the existing models. When new models are ready, Adaptive Decision Manager deploys them automatically into the Pega Decision Management decision engine. </br>  </br> <strong>Predictive versus Adaptive</strong> </br> Predictive and adaptive analytics are both used to predict customer behavior. So, how do you decide which method to use? Can you use them both? Can you use them both at the same time? </br>  </br> Predictive analytics requires historical data that contains the behavior you want to predict. </br>  </br> Adaptive analytics, on the other hand, can start with no data and learn from the data gathered during customer interactions. Because adaptive analytics learn on-the-fly, model creation happens automatically. </br>  </br> With predictive analytics, you have more control over the model because its development is a manual process that you are directly involved in and can influence. </br>  </br> Predictive modeling uses a range of powerful techniques, and you can select the best model for your needs. Adaptive modeling is a fully automated process, and as a result, you have very little control over the techniques used to predict behavior. </br>  </br> Adaptive models learn constantly and therefore their performance changes over time, which makes the outcome less predictable than that of predictive models. </br>  </br> Predictive models should be used when predictability and compliance is important. For example, risk-related behavior such as credit risk, claims risk, and fraud are perfect calculations for predictive models. </br>  </br> Also, some behavior types don’t happen quickly. For instance, with loan defaults or churn, it can take months or even years to accumulate significant amounts of data. Predictive modeling should be used in these situations. </br>  </br> Last but not least, it is possible to implement hundreds of adaptive models in a solution because of the high degree of automation. As a result, predictive models are useful for determining subtler and often high value behavior types such as …. </br>  </br> <table><tr><td> </br> Predictive</td><td> </br>  </br> Adaptive</td></tr><tr><td> </br>  </br> Requires historical data</td><td> </br>  </br> Learns from every interaction</td></tr><tr><td> </br>  </br> Greater control: model is hand-written</td><td> </br>  </br> Greater automation: model is auto-generated</td></tr><tr><td> </br>  </br> Ability to choose a model</td><td> </br>  </br> Models are auto-generated</td></tr><tr><td> </br>  </br> Applicable for Loans, Credit, Risk, Fraud</td><td> </br>  </br> Applicable for product acceptance, promise to pay</td></tr><tr><td> </br>  </br> Longer delay for outcome</td><td> </br>  </br> Shorter delay for outcome</td></tr><tr><td> </br>  </br> Tens of models</td><td> </br>  </br> Hundreds of models</td></tr> </br> </table> </br>  </br>  </br>  </br>  </br>  </br>  </br>  </br> "
  ]
}
